Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Methods
The WpfShapeCatalog type exposes the following members.
Methods
Name | Description
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
WpfShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace